samade123/digital_interfacing_lab_1/stm32f3xx_copy.h
/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3) || \
                                    ((INSTANCE) == UART4)  || \
                                    ((INSTANCE) == UART5))

/****************************** USB Instances *********************************/
#define IS_USB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB)

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/**
  * @}
  */


/******************************************************************************/
/*  For a painless codes migration between the STM32F3xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */ 
/*  product lines within the same STM32F3 Family                              */
/******************************************************************************/

/* Aliases for __IRQn */

#define ADC1_IRQn                      ADC1_2_IRQn
#define CAN_TX_IRQn                    USB_HP_CAN_TX_IRQn
#define CAN_RX0_IRQn                   USB_LP_CAN_RX0_IRQn
#define TIM15_IRQn                     TIM1_BRK_TIM15_IRQn
#define TIM16_IRQn                     TIM1_UP_TIM16_IRQn
#define TIM17_IRQn                     TIM1_TRG_COM_TIM17_IRQn
#define COMP_IRQn                      COMP1_2_3_IRQn
#define COMP2_IRQn                     COMP1_2_3_IRQn
#define COMP1_2_IRQn                   COMP1_2_3_IRQn
#define COMP4_6_IRQn                   COMP4_5_6_IRQn
#define TIM6_DAC1_IRQn                 TIM6_DAC_IRQn

/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                ADC1_2_IRQHandler
#define CAN_TX_IRQHandler              USB_HP_CAN_TX_IRQHandler
#define CAN_RX0_IRQHandler             USB_LP_CAN_RX0_IRQHandler
#define TIM15_IRQHandler               TIM1_BRK_TIM15_IRQHandler
#define TIM16_IRQHandler               TIM1_UP_TIM16_IRQHandler
#define TIM17_IRQHandler               TIM1_TRG_COM_TIM17_IRQHandler
#define COMP_IRQHandler                COMP1_2_3_IRQHandler
#define COMP2_IRQHandler               COMP1_2_3_IRQHandler
#define COMP1_2_IRQHandler             COMP1_2_3_IRQHandler
#define COMP4_6_IRQHandler             COMP4_5_6_IRQHandler
#define TIM6_DAC1_IRQHandler           TIM6_DAC_IRQHandler

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32F303xC_H */

/**
  * @}
  */

  /**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
